const postDummy = [
  {
    id: 'unique-id-1',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
  {
    id: 'unique-id-2',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
  {
    id: 'unique-id-3',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
  {
    id: 'unique-id-4',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
  {
    id: 'unique-id-5',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
  {
    id: 'unique-id-6',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
  {
    id: 'unique-id-7',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
  {
    id: 'unique-id-8',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
  {
    id: 'unique-id-9',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
  {
    id: 'unique-id-10',
    profile: {
      img: '/img/user_profile_example_1.jpeg',
      name: '김*숙',
    },
    content: {
      title: '고양이들이 이런 행동을 할 땐? 어떻게 해야할까요',
      text: `어제 밤부터 이상하게 침을 많이 흘리던데 왜 이러는 거예요? 라고들
                  많이 질문을 하십니다. 하지만 어떻게 해야할지는 다들 모르시죠. 저희
                  같은 경우엔 이렇게 합니다. 어떻게 하냐? 바로 이렇게요. 다들 어떤
                  도움을 줄 수 있냐 물어보는데 하기야 그럴 수도 있겠다는 생각이
                  들더라구요. 이럴 땐 굉장어제 밤부터 이상하게 침을 많이 흘리던데 왜
                  이러는 거예요? 라고들 많이 질문을 하십니다. 하지만 어떻게
                  해야할지는 다들 모르시죠. 저희 같은 경우엔 이렇게 합니다. 어떻게
                  하냐? 바로 이렇게요. 다들 어떤 도움을 줄 수 있냐 물어보는데 하기야
                  그럴 수도 있겠다는 생각이 들더라구요. 이럴 땐 굉장`,
    },
  },
];

export default postDummy;
